## <font color="purple"><h4 align="center">Read/Write CSV and Excel Files in Pandas</font>

### <font color="blue">Read CSV</color>

In [7]:
import pandas as pd

df = pd.read_csv("stock_data.csv")
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [8]:
df = pd.read_csv("stock_data.csv", skiprows=1)
df

    WMT           4.61  484    65           n.a.
0  MSFT             -1   85    64     bill gates
1  RIL   not available   50  1023  mukesh ambani
2  TATA            5.6   -1  n.a.     ratan tata

In [9]:
df = pd.read_csv("stock_data.csv", header=1) # skiprows and header are kind of same
df

    WMT           4.61  484    65           n.a.
0  MSFT             -1   85    64     bill gates
1  RIL   not available   50  1023  mukesh ambani
2  TATA            5.6   -1  n.a.     ratan tata

In [17]:
df = pd.read_csv("stock_data.csv", header=0, names = ["ticker","eps","price","revenue","people"])
df

  ticker            eps  price revenue         people
0  GOOGL          27.82     87     845     larry page
1    WMT           4.61    484      65           n.a.
2   MSFT             -1     85      64     bill gates
3   RIL   not available     50    1023  mukesh ambani
4   TATA            5.6     -1    n.a.     ratan tata

In [20]:
df = pd.read_csv("stock_data.csv",  nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [21]:
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [38]:
num = df._get_numeric_data()
num["revenue"] == -1

0    False
1    False
2    False
3    False
4    False
Name: revenue, dtype: bool

In [50]:
import numpy as np
df1 = pd.DataFrame(np.random.randn(10,3))
df1

          0         1         2
0 -0.463553 -0.519548  0.488506
1 -0.271323 -0.923306  2.563438
2  1.637770  0.103983 -0.291655
3  1.244553 -0.619912 -0.110609
4  0.740099  0.790103 -2.039455
5 -2.217209 -2.358188  0.961903
6  0.713129 -0.398900 -1.736158
7 -0.375777  0.411351 -0.176246
8 -1.148047  0.756260 -0.295306
9  0.833477 -1.247825 -0.023215

In [61]:
(df1[[0]] < 0).all(1)

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7     True
8     True
9    False
dtype: bool

In [65]:
df[(df[["revenue"]] < 0).all(1)]

Empty DataFrame
Columns: [tickers, eps, revenue, price, people]
Index: []

In [72]:
df['revenue'][df['revenue'] > 0]
#x = [i for i in df['remove'] if i > 0]

0     87.0
1    484.0
2     85.0
3     50.0
Name: revenue, dtype: float64

In [73]:
print('\n'.join(str(i) for i in [1,2,5]))

1
2
5

In [30]:
df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1] ,
        'people': ['not available','n.a.']
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

### <font color="blue">Write to CSV</color>

In [23]:
df.to_csv("new.csv", index=False)

In [77]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [80]:
df.to_csv("new.csv",header=False)

In [79]:
df.to_csv("new.csv", columns=["tickers","price"], index=False)

### <font color="blue">Read Excel</color>

In [85]:
df = pd.read_excel("stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [86]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell
    
df = pd.read_excel("stock_data.xlsx","Sheet1", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65     Sam Walton
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

### <font color="blue">Write to Excel</color>

In [92]:
df.to_excel("new.xlsx", sheet_name="stocks", index=False, startrow=3, startcol=1)

**Write two dataframes to two separate sheets in excel**

In [30]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [31]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")